#!/bin/bash

#Создать Cкрипт , который получит список прав на файлы внутри директории /opt/ВАШАГРУППА,
# и если среди них есть файлы sh , то добавит им права на исполнение.

TARGET_DIR="/opt/091224-ptm/"

find "$TARGET_DIR" -type f | while read -r file; do
  ls -la "$file" | awk '{print $1, $9}'
  if [[ "$file" == *.sh ]]; then
    chmod +x "$file"
    echo "=============================================="
    echo "Права на выполнение добавлены для файла: $file"
    echo "=============================================="
  fi
done

echo "Скрипт выполнен."